In [51]:
import pandas as pd
import numpy as np

df = pd.read_csv('house.csv')
df.head(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

### Práctica 1
Haz un corte por número de línea, quedándote con las primeras 500 líneas. Llama a este DF 'corte500'

Genera 2 dataframe (llamados sample1, sample2) aleatorio a partir de corte500, con un 55% de los valores, solamente de las columnas price, bedrooms, bathrooms, sqft_living, city.

In [56]:
corte500 = df.head(500)
sample1 = corte500[['price', 'bedrooms', 'bathrooms', 'sqft_living', 'city']].sample(frac=0.55, random_state=1)
sample2 = corte500[['price', 'bedrooms', 'bathrooms', 'sqft_living', 'city']].sample(frac=0.55, random_state=1)
sample1

        price  bedrooms  bathrooms  sqft_living         city
304  405000.0       3.0       2.25         1660    Shoreline
340  246000.0       3.0       1.75         1390         Kent
47   407500.0       3.0       2.50         1930       Renton
67   310000.0       3.0       1.00         1010   Snoqualmie
479  560000.0       3.0       2.00         2560       Auburn
..        ...       ...        ...          ...          ...
498  210000.0       3.0       2.50         1040      Seattle
154  609000.0       4.0       2.50         2150      Redmond
251  314500.0       3.0       1.75         1870  Federal Way
158  329350.0       2.0       1.00          720      Seattle
271  630000.0       2.0       2.25         2550       Renton

[275 rows x 5 columns]

# Aritmética y alineación de datos

Pandas simplifica las operaciones entre objetos con índices diferentes, alineando las operaciones según la etiqueta del índice. 

Si se trata de un DataFrame, alinea por nombre de columna y etiqueta de fila. 

Veamos un ejemplo:

In [57]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [58]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [59]:
# La resta se realiza coincidiendo el índice, rellenando el resto de valores con NaN
s1 - s2

a    9.4
c   -6.1
d    NaN
e    3.0
f    NaN
g    NaN
dtype: float64

### Práctica 2
Suma la columna precio de ambos samples. 

Una vez sumado, muestra los valores totales, los valores nulos, los valores no nulos. 

Series.isna() devuelve serie Booleana, con True si es nulo, False en caso contrario.

In [64]:
suma = sample1['price'] + sample2['price']
print(suma.count())
print(suma.isna().sum())
print(suma.notna().sum())

275
0
275

De la serie "suma" resultante elimina los nulos (dropan())y vuelve a mostrar.

In [66]:
suma_clean = suma.dropna()
print(suma_clean.count())

275

# Métodos aritméticos y evitar valores NaN

En operaciones aritméticas entre objetos indexados de manera diferente, es posible que desee completar los valores faltantes (nan) con un valor especial, como 0, cuando se encuentra una etiqueta de eje en un objeto pero no en el otro. 

Uusando el método del DataFrame o Serie para realizar la operación aritmética podemos indicar mediante el argumento 'fill_value' que sustituirá los valores NaN para realizar la operación aritmética.

Los métodos que comienzan por r tienen los operandos del reverso.

+ suma: add, radd 
+ resta: sub, rsub 	
+ división: div, rdiv 	
+ división entera: floordiv, rfloordiv 	
+ multiplicación: mul, rmul 	
+ exponente: pow, rpow

In [67]:
# Restamos a la Serie s1 los valores de s2 (s1 - s2)
s1.sub(s2, fill_value=0)

a    9.4
c   -6.1
d    3.4
e    3.0
f   -4.0
g   -3.1
dtype: float64

In [68]:
# Con rsub hacemos lo contrario, s2 - s1
s1.rsub(s2, fill_value=0)

a   -9.4
c    6.1
d   -3.4
e   -3.0
f    4.0
g    3.1
dtype: float64

### Práctica 3
Haz lo mismo que en práctica 2, utilizando el método suma y rellenando con 0 los valores faltantes.

In [69]:
# utilizando el método suma y rellenando con 0 los valores faltantes.
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

### Práctica 4
Copia el df corte500 y crea una nueva columna en la copia que sume la columna precio con la columna precio del dataframe sample1. 

A continuación, muestra las líneas que tienen en esa nueva columna los valores a NaN.

In [70]:
# Copia el df corte500 y crea una nueva columna en la copia que sume la columna precio con la columna precio del dataframe sample1. 
corte500_copy = corte500.copy()
corte500_copy["price_sum"] = sample1["price"]
# A continuación, muestra las líneas que tienen en esa nueva columna los valores a NaN. 
corte500_copy[corte500_copy["price_sum"].isna()]

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country,price_sum
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA,NaN
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA,NaN
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA,NaN
7,2014-05-02 00:00:00,482000.0,4.0,2.50,2710,35868,2.0,0,0,3,2710,0,1989,0,23762 SE 253rd Pl,Maple Valley,WA 98038,USA,NaN
8,2014-05-02 00:00:00,452500.0,3.0,2.50,2430,88426,1.0,0,0,4,1570,860,1985,0,46611-46625 SE 129th St,North Bend,WA 98045,USA,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
489,2014-05-12 00:00:00,372500.0,5.0,3.00,2480,10090,1.0,0,0,3,1300,1180,2004,2003,5537 S 119th St,Seattle,WA 98178,USA,NaN
490,2014-05-12 00:00:00,410000.0,3.0,2.25,2200,16921,2.0,0,0,3,2200,0,1987,2000,21709 SE 255th Pl,Maple Valley,WA 98038,USA,NaN
493,2014-05-12 00:00:00,225000.0,3.0,1.00,990,8012,1.0,0,0,4,990,0,1966,0,16411 120th Ave SE,Renton,WA 98058,USA,NaN
494,2014-05-12 00:00:00,647000.0,4.0,2.50,3040,6887,2.0,0,0,3,3040,0,1999,0,215 243rd Ave SE,Sammamish,WA 98074,USA,NaN
497,2014-05-12 00:00:00,335000.0,3.0,2.50,1940,4927,2.0,0,0,3,1940,0,2004,2003,17217 Woodside Dr SE,Renton,WA 98058,USA,NaN

# ufuncs de Numpy
Las funciones de NumPy ufuncs (los métodos que se aplicaban elemento a elemento del array, como calcular el valor absoluto de cada uno (np.abs()) también funcionan en Pandas. Se puede aplicar a una SEries o a todo un DataFrame

In [10]:
df = pd.DataFrame(np.random.standard_normal((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])
df.head()

               b         d         e
Utah    0.630049 -0.348796 -1.793176
Ohio    1.204266  1.431323  0.249087
Texas  -1.639113 -2.231648  0.552230
Oregon  0.474509 -0.557433 -0.116853

In [11]:
# Devuelve un DataFrame con los valores modificados
np.abs(df)

               b         d         e
Utah    0.630049  0.348796  1.793176
Ohio    1.204266  1.431323  0.249087
Texas   1.639113  2.231648  0.552230
Oregon  0.474509  0.557433  0.116853

# Práctica 5

Aplia la raíz cuadrada a la columna precio de sample1 con una función de numpy.

In [73]:
sample1["price"].apply(np.sqrt)

304    636.396103
340    495.983871
47     638.357267
67     556.776436
479    748.331477
          ...
498    458.257569
154    780.384521
251    560.802996
158    573.890233
271    793.725393
Name: price, Length: 275, dtype: float64

# Apply de Pandas
El método apply sirve para aplicar cualquier función definida por el programador a cada elemento de la Series, devolviendo una nueva Series con el resultado. 

También se puede aplicar a todo un DataFrame por filas o por columnas (devuelve un objeto Series). Por defecto se aplica la función a cada columna.

In [12]:
df.head()

               b         d         e
Utah    0.630049 -0.348796 -1.793176
Ohio    1.204266  1.431323  0.249087
Texas  -1.639113 -2.231648  0.552230
Oregon  0.474509 -0.557433 -0.116853

In [13]:
# Tenemos una función que recibe una Serie y devuelve el valor máximo.
def funcion1(x):
    return x.max()

# Aplicamos la función al DataFrame (por defecto axis=0). Obteniendo el máximo de cada columna. 
df.apply(funcion1)

b    1.204266
d    1.431323
e    0.552230
dtype: float64

In [14]:
# Busca en el eje horizontal, sacando el máximo de cada fila
df.apply(funcion1, axis='columns')

Utah      0.630049
Ohio      1.431323
Texas     0.552230
Oregon    0.474509
dtype: float64

# Práctica 6

Crea una función que se aplique a los valores de badroom de sample1 un redondeo el valor al entero más cercano

In [75]:
def redondeo(x):
    return round(x)
sample1["bedrooms"].apply(redondeo)

304    3
340    3
47     3
67     3
479    3
      ..
498    3
154    4
251    3
158    2
271    2
Name: bedrooms, Length: 275, dtype: int64

La función a aplicar con apply también puede recibir parámetros

Busca en la documentación de Pandas.

Crea una función similar a la anterior, pero que si el número de baños es mayor a 4 devuelva el entero pasado por parámetro.

In [107]:
def redondeo_bathrooms(x, entero):
    if x > 4:
        return entero
    else:
        return round(x)
sample1["bathrooms"].apply(redondeo_bathrooms, entero=999)

304    2
340    2
47     2
67     1
479    2
      ..
498    2
154    2
251    2
158    1
271    2
Name: bathrooms, Length: 275, dtype: int64

# Ordenación por etiquetas del índice
Podemos ordenar por las etiqueas de las filas o columnas utilizando el método sort_index, que retorna un nuevo objeto ordenado. Por defecto ordena en orden ascendente. 

frame.sort_index(axis="columns", ascending=False)

Podemos ordenar por filas -> 'rows'.

In [89]:
df.sort_index(axis="columns", ascending=False)

   Ventas  Gastos     Ciudad   Año
0     100      70     Madrid  2023
1     120      80     Madrid  2024
2      90      60  Barcelona  2023
3     110      75  Barcelona  2024

# Práctica 7
Ordena sample 1 por su etiqueta fila

In [112]:
sample1.sort_index(axis="index", ascending=True)

         price  bedrooms  bathrooms  sqft_living         city
0     313000.0       3.0       1.50         1340    Shoreline
4     550000.0       4.0       2.50         1940      Redmond
5     490000.0       2.0       1.00          880      Seattle
6     335000.0       2.0       2.00         1350      Redmond
9     640000.0       4.0       2.00         1520      Seattle
..         ...       ...        ...          ...          ...
492  1015000.0       3.0       2.50         2920      Seattle
495   950000.0       5.0       3.00         4530  Woodinville
496   185000.0       3.0       1.50         1370       Auburn
498   210000.0       3.0       2.50         1040      Seattle
499   522000.0       4.0       2.25         1800     Kirkland

[275 rows x 5 columns]

# Ordenación por valores

Al ordenar un DataFrame por valores de una columna, podemos especificar por cuál columna ordenar. También podemos indicar una lista de columnas. 

+ df.sort_values('columna')
+ df.sort_values(['col1', 'col2'])

# Práctica 8

Ordena sample1 número de habitaciones en primer lugar y después por precio.

In [113]:
sample1.sort_values(["bedrooms", "price"])

         price  bedrooms  bathrooms  sqft_living              city
477   235000.0       1.0       1.00          810           Seattle
260   250000.0       1.0       1.00         1100            Burien
290   100000.0       2.0       1.00          910            Algona
326   134000.0       2.0       1.50          980         Skykomish
298   160000.0       2.0       1.00         1040              Kent
..         ...       ...        ...          ...               ...
372   543200.0       6.0       2.25         2820            Burien
92    823000.0       6.0       1.75         2920           Seattle
284  1500000.0       6.0       2.50         3560           Seattle
291   540000.0       7.0       5.75         3700  Lake Forest Park
122  2280000.0       7.0       8.00        13540           Redmond

[275 rows x 5 columns]

# Práctica 9
Genera una serie con el precio medio de cada ciudad. Si necesitas bucles puedes usarlos.

In [133]:
ciudades = corte500["city"]
precios_medios = {}
for ciudad in ciudades:
    precios_ciudad = corte500[corte500["city"] == ciudad]["price"]
    precio_medio = precios_ciudad.mean()
    precios_medios[ciudad] = precio_medio
serie_precios_medios = pd.Series(precios_medios)
serie_precios_medios

Shoreline              4.206208e+05
Seattle                5.935525e+05
Kent                   3.039889e+05
Bellevue               7.411441e+05
Redmond                7.249314e+05
Maple Valley           3.355188e+05
North Bend             3.436980e+05
Lake Forest Park       5.226667e+05
Sammamish              7.653389e+05
Auburn                 3.356531e+05
Des Moines             2.719750e+05
Bothell                4.991667e+05
Federal Way            3.058735e+05
Kirkland               5.958160e+05
Issaquah               6.289941e+05
Woodinville            6.570115e+05
Normandy Park          5.252500e+05
Fall City              3.050000e+05
Renton                 4.162706e+05
Carnation              4.902000e+05
Snoqualmie             4.973333e+05
Duvall                 3.949750e+05
Burien                 3.599700e+05
Covington              2.407500e+05
Inglewood-Finn Hill    4.250000e+05
Kenmore                4.964250e+05
Newcastle              5.560630e+05
Mercer Island          1.244164e+06
Black Diamond          2.439750e+05
Ravensdale             4.566667e+05
Clyde Hill             1.018500e+06
Algona                 2.100000e+05
Skykomish              1.340000e+05
Tukwila                2.290000e+05
Vashon                 2.550000e+05
dtype: float64

# Práctica 10

Genera un df a partir de sample1 con las casas más baratas que la media en función de la ciudad en la que se encuentran.

In [138]:
# Genera un df a partir de sample1 con las casas más baratas que la media en función de la ciudad en la que se encuentran.
precios_medios_ciudad = serie_precios_medios.to_dict()
def es_mas_barata_que_media(row):
    ciudad = row['city']
    precio = row['price']
    precio_medio = precios_medios_ciudad.get(ciudad, float('inf'))
    return precio < precio_medio
casas_mas_baratas = sample1[sample1.apply(es_mas_barata_que_media, axis=1)]
casas_mas_baratas

        price  bedrooms  bathrooms  sqft_living        city
304  405000.0       3.0       2.25         1660   Shoreline
340  246000.0       3.0       1.75         1390        Kent
47   407500.0       3.0       2.50         1930      Renton
67   310000.0       3.0       1.00         1010  Snoqualmie
485  350000.0       2.0       1.00          910     Seattle
..        ...       ...        ...          ...         ...
403  445000.0       4.0       2.00         1650     Seattle
53   284000.0       3.0       1.75         1800   Carnation
498  210000.0       3.0       2.50         1040     Seattle
154  609000.0       4.0       2.50         2150     Redmond
158  329350.0       2.0       1.00          720     Seattle

[176 rows x 5 columns]

# MultiIndex

__set_index__ nos permite indicar qué columna serán las etiquetas de las filas (índice de filas). Pero también podemos indicar más de una columna, obteniendo indices de varios niveles.

Si seleccionamos una columna que no es única en sus valores debemos tenerlo en cuenta, ya que tendremos un índice no único como filas.

In [90]:
# Ejemplo
import pandas as pd

data = {
    'Ciudad': ['Madrid', 'Madrid', 'Barcelona', 'Barcelona'],
    'Año': [2023, 2024, 2023, 2024],
    'Ventas': [100, 120, 90, 110],
    'Gastos': [70, 80, 60, 75]
}
df = pd.DataFrame(data)
df.head()

      Ciudad   Año  Ventas  Gastos
0     Madrid  2023     100      70
1     Madrid  2024     120      80
2  Barcelona  2023      90      60
3  Barcelona  2024     110      75

In [91]:
# Agrupamos datos primero por Ciudad y luego por Año
df_multi = df.set_index(['Ciudad', 'Año'])
df_multi.head()

                Ventas  Gastos
Ciudad    Año
Madrid    2023     100      70
          2024     120      80
Barcelona 2023      90      60
          2024     110      75

In [92]:
# Indexación en orden de jerarquía
# Todos los datos de madrid 
df_multi.loc['Madrid']

      Ventas  Gastos
Año
2023     100      70
2024     120      80

In [93]:
# Indexación de filas concretas usando una tupla de índices
# Madrid 2023  
df_multi.loc[('Madrid', 2023)]

Ventas    100
Gastos     70
Name: (Madrid, 2023), dtype: int64

# Práctica 11

Carga house de nuevo en un df. Pon la columna City como índices de primer nivel y bedrooms como segundo nivel. Ordena los datos por estos índices.

In [135]:
# Carga house de nuevo en un df. Pon la columna City como índices de primer nivel y bedrooms como segundo nivel. Ordena los datos por estos índices.
# Idexa por las columnas indicadas y ordena
df_house = pd.read_csv('house.csv')
df_house_multi = df_house.set_index(['city', 'bedrooms'])
df_house_multi.sort_index(inplace=True)
df_house_multi.head()

                                date     price  bathrooms  sqft_living  \
city   bedrooms
Algona 2.0       2014-05-07 00:00:00  100000.0        1.0          910
       3.0       2014-05-08 00:00:00  230000.0        1.0         1390
       3.0       2014-05-30 00:00:00  196440.0        2.0         1560
       4.0       2014-05-08 00:00:00  262000.0        2.5         2020
       4.0       2014-05-09 00:00:00  248000.0        3.0         2163

                 sqft_lot  floors  waterfront  view  condition  sqft_above  \
city   bedrooms
Algona 2.0          22000     1.0           0     0          3         910
       3.0          16000     1.0           0     0          4        1390
       3.0           7352     1.0           0     0          3        1560
       4.0           6236     2.0           0     0          3        2020
       4.0           5883     2.0           0     0          3        2163

                 sqft_basement  yr_built  yr_renovated                street  \
city   bedrooms
Algona 2.0                   0      1956          2001    138 Seattle Blvd S
       3.0                   0      1960          2001         322 9th Ave N
       3.0                   0      1992             0           130 Main St
       4.0                   0      2002             0       434 Pullman Ave
       4.0                   0      2006             0  429 Milwaukee Blvd S

                 statezip country
city   bedrooms
Algona 2.0       WA 98001     USA
       3.0       WA 98001     USA
       3.0       WA 98001     USA
       4.0       WA 98001     USA
       4.0       WA 98001     USA

In [136]:
# Muestra los datos de la ciudad Auburn
df_house_multi.loc['Auburn']

,date,price,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
bedrooms,,,,,,,,,,,,,,,,
1.0,2014-07-08 00:00:00,115000.0,2.00,1150,9812,1.0,0,0,4,1150,0,1962,0,34215 40th Ave S,WA 98001,USA
2.0,2014-05-20 00:00:00,415000.0,1.00,1050,60113,1.0,0,0,4,1050,0,1943,0,3720 S 312th Ln,WA 98001,USA
2.0,2014-05-23 00:00:00,175000.0,1.00,1300,44431,1.0,0,0,5,1300,0,1958,0,30557 55th Ave S,WA 98001,USA
2.0,2014-05-28 00:00:00,189000.0,2.00,1700,3171,1.0,0,0,5,850,850,1927,0,508 D St SE,WA 98002,USA
2.0,2014-06-05 00:00:00,214100.0,2.50,1150,2064,2.0,0,0,3,1150,0,2004,2003,27852 31st Pl S,WA 98001,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5.0,2014-06-27 00:00:00,327000.0,2.75,2400,8050,2.0,0,0,3,2400,0,1998,2006,5020 Quincy Ave SE,WA 98092,USA
5.0,2014-07-03 00:00:00,285000.0,2.50,2270,6300,2.0,0,0,3,2270,0,1995,0,12840 SE 307th Pl,WA 98092,USA
6.0,2014-05-20 00:00:00,300000.0,5.25,2860,5682,2.0,0,0,3,2860,0,1978,0,606 5th St SE,WA 98002,USA
6.0,2014-05-21 00:00:00,260000.0,2.00,2220,8797,1.0,0,0,3,2220,0,1977,2004,142 11th St SE,WA 98002,USA
7.0,2014-06-25 00:00:00,280000.0,2.50,1940,5458,2.0,0,0,3,1940,0,1994,0,12307 SE 315th Pl,WA 98092,USA

In [137]:
# Muestra los datos de Auburn con 6 habitaciones
df_house_multi.loc[('Auburn', 6)]

                                date     price  bathrooms  sqft_living  \
city   bedrooms
Auburn 6.0       2014-05-20 00:00:00  300000.0       5.25         2860
       6.0       2014-05-21 00:00:00  260000.0       2.00         2220

                 sqft_lot  floors  waterfront  view  condition  sqft_above  \
city   bedrooms
Auburn 6.0           5682     2.0           0     0          3        2860
       6.0           8797     1.0           0     0          3        2220

                 sqft_basement  yr_built  yr_renovated          street  \
city   bedrooms
Auburn 6.0                   0      1978             0   606 5th St SE
       6.0                   0      1977          2004  142 11th St SE

                 statezip country
city   bedrooms
Auburn 6.0       WA 98002     USA
       6.0       WA 98002     USA